In [1]:
import pandas as pd
import numpy as np

In [2]:
# List-to-Series Conversion'
li = [2, 4, 5, 6]
ds = pd.Series(li)
ds

0    2
1    4
2    5
3    6
dtype: int64

In [4]:
ds1 = pd.Series([2, 4, 6, 8, 10], index=[1, 3, 5, 7, 9])
ds1

1     2
3     4
5     6
7     8
9    10
dtype: int64

In [5]:
ds1.apply(lambda x:x/2)

1    1.0
3    2.0
5    3.0
7    4.0
9    5.0
dtype: float64

In [6]:
di = {'name': ['Vinay', 'Kushal', 'Aman'],
              'age' : [22, 25, 24],
              'occ' : ['engineer', 'doctor', 'accountant']}
df = pd.DataFrame(di)

In [7]:
df

     name  age         occ
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant

In [9]:
#2D List-to-Dataframe Conversion
lists = [[2, 'Vishal', 22],
         [1, 'Kushal', 25],
         [1, 'Aman', 24]]
df1 = pd.DataFrame(lists, columns=['id', 'name', 'age'])
df1

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

In [10]:
credit = pd.read_csv("../../Downloads/Credit card transactions - India - Simple.csv")

In [11]:
credit

,index,City,Date,Card Type,Exp Type,Gender,Amount
0,0,"Delhi, India",29-Oct-14,Gold,Bills,F,82475
1,1,"Greater Mumbai, India",22-Aug-14,Platinum,Bills,F,32555
2,2,"Bengaluru, India",27-Aug-14,Silver,Bills,F,101738
3,3,"Greater Mumbai, India",12-Apr-14,Signature,Bills,F,123424
4,4,"Bengaluru, India",5-May-15,Gold,Bills,F,171574
...,...,...,...,...,...,...,...
26047,26047,"Kolkata, India",22-Jun-14,Silver,Travel,F,128191
26048,26048,"Pune, India",3-Aug-14,Signature,Travel,M,246316
26049,26049,"Hyderabad, India",16-Jan-15,Silver,Travel,M,265019
26050,26050,"Kanpur, India",14-Sep-14,Silver,Travel,M,88174
26051,26051,"Hyderabad, India",19-Oct-13,Signature,Bills,M,184410

In [12]:
credit.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [13]:
credit.isna().sum()

index        0
City         0
Date         0
Card Type    0
Exp Type     0
Gender       0
Amount       0
dtype: int64

In [14]:
credit.dtypes

index         int64
City         object
Date         object
Card Type    object
Exp Type     object
Gender       object
Amount        int64
dtype: object

In [15]:
credit.drop('index', axis=1)

                        City       Date  Card Type Exp Type Gender  Amount
0               Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2           Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4           Bengaluru, India   5-May-15       Gold    Bills      F  171574
...                      ...        ...        ...      ...    ...     ...
26047         Kolkata, India  22-Jun-14     Silver   Travel      F  128191
26048            Pune, India   3-Aug-14  Signature   Travel      M  246316
26049       Hyderabad, India  16-Jan-15     Silver   Travel      M  265019
26050          Kanpur, India  14-Sep-14     Silver   Travel      M   88174
26051       Hyderabad, India  19-Oct-13  Signature    Bills      M  184410

[26052 rows x 6 columns]

In [18]:
credit.groupby(['City', 'Card Type'])

In [19]:
credit.Amount.mean()

156411.5374251497

In [20]:
credit.describe()

              index         Amount
count  26052.000000   26052.000000
mean   13025.500000  156411.537425
std     7520.708943  103063.254287
min        0.000000    1005.000000
25%     6512.750000   77120.250000
50%    13025.500000  153106.500000
75%    19538.250000  228050.000000
max    26051.000000  998077.000000

In [21]:
credit.groupby('Card Type')['Amount'].mean()

Card Type
Gold         154631.621800
Platinum     157492.813223
Signature    157133.721886
Silver       156376.273830
Name: Amount, dtype: float64

In [22]:
g = credit.groupby('City')
g.first()

                  index       Date  Card Type       Exp Type Gender  Amount
City
Achalpur, India   14133  24-Jul-14  Signature        Grocery      M  192579
Adilabad, India   14894  14-Feb-15   Platinum          Bills      F  278459
Adityapur, India  14599  17-Sep-14       Gold           Fuel      M   50289
Adoni, India      14613  25-Jan-15   Platinum        Grocery      F   40082
Adoor, India      15304  20-Apr-14   Platinum           Fuel      M  250113
...                 ...        ...        ...            ...    ...     ...
Zaidpur, India    14079  21-Jan-15     Silver           Food      F    7134
Zamania, India    15280  18-Jul-14     Silver  Entertainment      M    5006
Zira, India       14063  25-Apr-14  Signature  Entertainment      M  218424
Zirakpur, India   14567   8-Dec-14   Platinum           Food      M  175566
Zunheboto, India  15530   4-Nov-13  Signature          Bills      M   89271

[986 rows x 6 columns]

In [23]:
g = credit.groupby(['City', 'Card Type'])
g.first()

                            index       Date       Exp Type Gender  Amount
City             Card Type
Achalpur, India  Gold       15170  28-Oct-14          Bills      M  173336
                 Platinum   17041   6-Feb-14        Grocery      F  178612
                 Signature  14133  24-Jul-14        Grocery      M  192579
                 Silver     19373   6-Dec-13        Grocery      F  201032
Adilabad, India  Gold       19457  20-Feb-15        Grocery      M   49020
...                           ...        ...            ...    ...     ...
Zira, India      Signature  14063  25-Apr-14  Entertainment      M  218424
                 Silver     16047  26-Sep-14           Fuel      M   98224
Zirakpur, India  Platinum   14567   8-Dec-14           Food      M  175566
Zunheboto, India Signature  15530   4-Nov-13          Bills      M   89271
                 Silver     18804   1-Dec-14  Entertainment      F   78591

[3104 rows x 5 columns]

In [24]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [26]:
result = student_data.groupby(['school_code'])

In [30]:
for name, group in result:
    print(name)
    print(group)
    print(type(result))

s001
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
s002
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
s004
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [31]:
#Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [32]:
student_data.groupby('school_code')['age'].agg(['mean', 'min', 'max'])

             mean  min  max
school_code
s001         12.5   12   13
s002         13.0   12   14
s003         13.0   13   13
s004         12.0   12   12

In [33]:
student_data.groupby('school_code').agg({'weight':['mean', 'min', 'max']})

            weight
              mean min max
school_code
s001          32.5  30  35
s002          31.5  31  32
s003          33.0  33  33
s004          32.0  32  32

In [34]:
result1 = student_data.groupby(['school_code', 'class'])

In [35]:
for name, group in result1:
    print(name)
    print(group)

('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [37]:
result = student_data.groupby('school_code')
print(list(result))

[('s001',    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1  ), ('s002',    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), ('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), ('s004',    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

In [38]:
grouped_single = student_data.groupby('school_code')
print(grouped_single.size())

school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64

In [39]:
grouped_mul = student_data.groupby(['school_code', 'class'])
print(grouped_mul.size())

school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

In [40]:
# ../../Downloads/BigMartSales.csv

In [42]:
df = pd.read_csv("../../Downloads/BigMartSales.csv")

In [43]:
df.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [46]:
df.groupby('Outlet_Location_Type').count()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Type,Item_Outlet_Sales
Outlet_Location_Type,,,,,,,,,,,
Tier 1,2388,1860,2388,2388,2388,2388,2388,2388,2388,2388,2388
Tier 2,2785,2785,2785,2785,2785,2785,2785,2785,930,2785,2785
Tier 3,3350,2415,3350,3350,3350,3350,3350,3350,2795,3350,3350

In [47]:
df.groupby('Outlet_Location_Type')['Item_Outlet_Sales'].sum()

Outlet_Location_Type
Tier 1    4.482059e+06
Tier 2    6.472314e+06
Tier 3    7.636753e+06
Name: Item_Outlet_Sales, dtype: float64

In [48]:
obj = df.groupby('Outlet_Location_Type')

In [49]:
obj.groups

{'Tier 1': [0, 2, 10, 11, 12, 13, 15, 17, 23, 24, 29, 34, 35, 40, 42, 48, 49, 50, 57, 58, 59, 63, 69, 70, 74, 75, 76, 77, 80, 81, 83, 88, 89, 91, 95, 96, 99, 102, 108, 110, 112, 115, 126, 131, 135, 143, 145, 154, 163, 164, 178, 182, 186, 187, 189, 190, 191, 195, 196, 197, 204, 206, 208, 220, 222, 225, 227, 234, 236, 248, 250, 252, 255, 270, 274, 284, 289, 295, 297, 299, 301, 308, 311, 312, 321, 324, 334, 336, 344, 345, 346, 347, 348, 353, 354, 355, 356, 358, 361, 363, ...], 'Tier 2': [8, 9, 19, 22, 25, 26, 33, 46, 47, 53, 54, 56, 61, 66, 67, 68, 72, 73, 78, 79, 85, 86, 92, 93, 94, 97, 100, 107, 111, 114, 116, 117, 118, 120, 121, 123, 124, 125, 127, 129, 137, 138, 140, 141, 142, 144, 146, 147, 148, 149, 150, 157, 158, 165, 166, 170, 171, 176, 179, 181, 188, 192, 200, 201, 202, 207, 210, 211, 212, 213, 219, 221, 223, 228, 232, 233, 240, 241, 242, 243, 244, 245, 247, 249, 254, 256, 258, 259, 261, 262, 263, 264, 268, 273, 277, 281, 283, 285, 288, 290, ...], 'Tier 3': [1, 3, 4, 5, 6, 7, 14, 16, 18, 20, 21, 27, 28, 30, 31, 32, 36, 37, 38, 39, 41, 43, 44, 45, 51, 52, 55, 60, 62, 64, 65, 71, 82, 84, 87, 90, 98, 101, 103, 104, 105, 106, 109, 113, 119, 122, 128, 130, 132, 133, 134, 136, 139, 151, 152, 153, 155, 156, 159, 160, 161, 162, 167, 168, 169, 172, 173, 174, 175, 177, 180, 183, 184, 185, 193, 194, 198, 199, 203, 205, 209, 214, 215, 216, 217, 218, 224, 226, 229, 230, 231, 235, 237, 238, 239, 246, 251, 253, 257, 260, ...]}

In [51]:
obj.get_group('Tier 1')

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
10,FDY07,11.80,Low Fat,0.000000,Fruits and Vegetables,45.5402,OUT049,1999,Medium,Tier 1,Supermarket Type1,1516.0266
11,FDA03,18.50,Regular,0.045464,Dairy,144.1102,OUT046,1997,Small,Tier 1,Supermarket Type1,2187.1530
12,FDX32,15.10,Regular,0.100014,Fruits and Vegetables,145.4786,OUT049,1999,Medium,Tier 1,Supermarket Type1,1589.2646
...,...,...,...,...,...,...,...,...,...,...,...,...
8480,FDQ58,NaN,Low Fat,0.000000,Snack Foods,154.5340,OUT019,1985,Small,Tier 1,Grocery Store,459.4020
8490,FDU44,NaN,Regular,0.102296,Fruits and Vegetables,162.3552,OUT019,1985,Small,Tier 1,Grocery Store,487.3656
8492,FDT34,9.30,Low Fat,0.174350,Snack Foods,104.4964,OUT046,1997,Small,Tier 1,Supermarket Type1,2419.5172
8517,FDF53,20.75,reg,0.083607,Frozen Foods,178.8318,OUT046,1997,Small,Tier 1,Supermarket Type1,3608.6360
8522,DRG01,14.80,Low Fat,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [53]:
import datetime
from datetime import datetime
datetime(2024, 1, 20)

datetime.datetime(2024, 1, 20, 0, 0)

In [54]:
datetime(2011, 1, 11, 21, 20)

datetime.datetime(2011, 1, 11, 21, 20)

In [55]:
datetime.now()

datetime.datetime(2023, 1, 27, 13, 40, 52, 652624)

In [57]:
datetime.now().date()

datetime.date(2023, 1, 27)

In [58]:
datetime.now().time()

datetime.time(13, 48, 49, 325478)

In [59]:
datetime.time(datetime(2012, 12, 15, 18, 12))

datetime.time(18, 12)

In [60]:
datetime.date(datetime(2012, 12, 15, 18, 12))

datetime.date(2012, 12, 15)

In [61]:
datetime(2016, 12, 27)

datetime.datetime(2016, 12, 27, 0, 0)

In [62]:
datetime.now()

datetime.datetime(2023, 1, 27, 13, 56, 4, 126845)

In [63]:
pd.Timestamp('2016-11-6')

Timestamp('2016-11-06 00:00:00')

In [66]:
pd.Timestamp('11:30')

Timestamp('2023-01-27 11:30:00')

In [67]:
pd.Timestamp('now')

Timestamp('2023-01-27 18:58:01.336224')

In [68]:
date1 = datetime(year=2020, month=12, day=6)

In [69]:
date1

datetime.datetime(2020, 12, 6, 0, 0)

In [152]:
today= datetime(2023, 1, 28)
today

datetime.datetime(2023, 1, 28, 0, 0)

In [155]:
tomorrow = today + pd.Timedelta(days=20)

In [156]:
tomorrow

datetime.datetime(2023, 2, 17, 0, 0)

In [157]:
yesterday = today - pd.Timedelta(days=20)

In [158]:
yesterday

datetime.datetime(2023, 1, 8, 0, 0)

In [81]:
date1 = datetime(2023, 1, 20)
date2 = datetime(2023, 1, 10)

In [82]:
date1 - date2

datetime.timedelta(days=10)

In [83]:
import numpy as np

In [86]:
np.random.rand(2)

array([0.03676494, 0.53719648])

In [87]:
dates = [datetime(2022, 1, 20), datetime(2022, 1, 30)]

In [88]:
time_series = pd.Series(np.random.rand(2), dates)

In [89]:
time_series

2022-01-20    0.052998
2022-01-30    0.757179
dtype: float64

In [92]:
dates = ['2022-1-20', '2012-1-5', '2013-1-20']
timeseries = pd.Series(np.random.rand(3), dates)

In [93]:
timeseries

2022-1-20    0.945563
2012-1-5     0.200321
2013-1-20    0.359211
dtype: float64

In [94]:
data = {'Gender':['m','f','f','m','f','m','m'],'Height':[172,171,169,173,170,175,178]}

In [96]:
df1 = pd.DataFrame(data)

In [97]:
df1

  Gender  Height
0      m     172
1      f     171
2      f     169
3      m     173
4      f     170
5      m     175
6      m     178

In [98]:
df1.groupby("Gender").count()

        Height
Gender
f            3
m            4

In [102]:
df1.groupby("Gender").mean()

        Height
Gender
f        170.0
m        174.5

In [103]:
datetime.now()

datetime.datetime(2023, 1, 28, 10, 41, 30, 65919)

In [105]:
datetime(2022, 11, 27, 10, 20)

datetime.datetime(2022, 11, 27, 10, 20)

In [106]:
datetime.now().date()

datetime.date(2023, 1, 28)

In [107]:
datetime.now().time()

datetime.time(10, 42, 57, 743093)

In [109]:
pd.Timestamp('2022-2-6')

Timestamp('2022-02-06 00:00:00')

In [110]:
pd.Timestamp('11:20')

Timestamp('2023-01-28 11:20:00')

In [111]:
pd.Timestamp('now')

Timestamp('2023-01-28 10:45:25.912742')

In [113]:
date1 = datetime(year=2022, month=12, day=12)

In [114]:
date1

datetime.datetime(2022, 12, 12, 0, 0)

In [115]:
from dateutil import parser

In [116]:
date2 = parser.parse("1st of january 2023")
date2

datetime.datetime(2023, 1, 1, 0, 0)

In [117]:
today = datetime(2023, 1, 28)
tomorrow = today + pd.Timedelta(days=1)

In [118]:
tomorrow

datetime.datetime(2023, 1, 29, 0, 0)

In [119]:
yesterday = today - pd.Timedelta(days=2)

In [120]:
yesterday

datetime.datetime(2023, 1, 26, 0, 0)

In [121]:
d1 = datetime(2022, 1, 23)
d2 = datetime(2022, 1, 13)

In [122]:
d1-d2

datetime.timedelta(days=10)

In [123]:
dates = [datetime(2022, 12, 6), datetime(2022, 12, 10)]
time_series = pd.Series(np.random.randn(2), dates)

In [124]:
time_series

2022-12-06    2.017402
2022-12-10   -1.071754
dtype: float64

In [125]:
dates = ['2020-1-20', '2021-1-25', '2022-1-30', '2023-1-4']
time_series = pd.Series(np.random.randn(4), dates)

In [126]:
time_series

2020-1-20    1.472020
2021-1-25   -2.385120
2022-1-30   -0.239433
2023-1-4    -1.643167
dtype: float64

In [127]:
#Write a Pandas program to create a time series object that has time indexed data. Also select the dates of same year and select the dates between certain dates.

In [129]:
index = pd.DatetimeIndex(['2011-09-02', '2012-08-04',
                          '2015-09-03', '2010-08-04',
                          '2015-03-03', '2011-08-04',
                          '2015-04-03', '2012-08-04'])

In [131]:
sd = pd.Series([0, 1, 2, 3, 4, 5, 6, 7], index = index)

In [132]:
sd

2011-09-02    0
2012-08-04    1
2015-09-03    2
2010-08-04    3
2015-03-03    4
2011-08-04    5
2015-04-03    6
2012-08-04    7
dtype: int64

In [133]:
sd['2015']

2015-09-03    2
2015-03-03    4
2015-04-03    6
dtype: int64

In [134]:
sd['2012-1-1':'2012-12-30']

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_1100\2519756932.py:1: FutureWarning: Value based partial slicing on non-monotonic DatetimeIndexes with non-existing keys is deprecated and will raise a KeyError in a future Version.
  sd['2012-1-1':'2012-12-30']

2012-08-04    1
2012-08-04    7
dtype: int64

In [135]:
date_range = pd.date_range('2020-1-1', periods=42)

In [136]:
date_range

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01',
               '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09',
               '2020-02-10', '2020-02-11'],
              dtype='datetime64[ns]', freq='D')

In [137]:
dates = pd.Series(pd.date_range('2020-1-1', periods=31, freq='D'))
dates

0    2020-01-01
1    2020-01-02
2    2020-01-03
3    2020-01-04
4    2020-01-05
5    2020-01-06
6    2020-01-07
7    2020-01-08
8    2020-01-09
9    2020-01-10
10   2020-01-11
11   2020-01-12
12   2020-01-13
13   2020-01-14
14   2020-01-15
15   2020-01-16
16   2020-01-17
17   2020-01-18
18   2020-01-19
19   2020-01-20
20   2020-01-21
21   2020-01-22
22   2020-01-23
23   2020-01-24
24   2020-01-25
25   2020-01-26
26   2020-01-27
27   2020-01-28
28   2020-01-29
29   2020-01-30
30   2020-01-31
dtype: datetime64[ns]

In [138]:
dates.min()

Timestamp('2020-01-01 00:00:00')

In [139]:
dates.max()

Timestamp('2020-01-31 00:00:00')

In [140]:
dates.idxmax()

30

In [141]:
dates.idxmin()

0

In [142]:
time = pd.date_range('1/1/2020', periods = 20, freq='2M')

In [143]:
time

DatetimeIndex(['2020-01-31', '2020-03-31', '2020-05-31', '2020-07-31',
               '2020-09-30', '2020-11-30', '2021-01-31', '2021-03-31',
               '2021-05-31', '2021-07-31', '2021-09-30', '2021-11-30',
               '2022-01-31', '2022-03-31', '2022-05-31', '2022-07-31',
               '2022-09-30', '2022-11-30', '2023-01-31', '2023-03-31'],
              dtype='datetime64[ns]', freq='2M')

In [144]:
from datetime import date

In [147]:
now = pd.to_datetime(str(date.today()))

In [148]:
now

Timestamp('2023-01-28 00:00:00')

In [150]:
now = pd.to_datetime(str(datetime.today()))

In [151]:
now

Timestamp('2023-01-28 16:23:33.838117')

In [159]:
index = pd.DatetimeIndex(['2011-09-02', '2012-08-04',
                          '2015-09-03', '2010-08-04',
                          '2015-03-03', '2011-08-04',
                          '2015-04-03', '2012-08-04'])